Tekla.Structures.Drawing.InvalidAttributesForOperationException
The InvalidAttributesForOperationException class defines the exception
that is thrown when an object's attributes are set to something that is
not valid for the object.

Tekla.Structures.Drawing.InvalidAttributesForOperationException.#ctor(System.String)
Creates a new exception instance.
Message: The exception message.

Tekla.Structures.Drawing.InvalidAttributesForOperationException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.